<template>
  <main>
    <div class="mx-auto max-w-7xl py-6 sm:px-6 lg:px-8">
      <div class="mx-auto max-w-7xl py-6 shadow-lg rounded-lg">
        <div class="shadow-md h-128 overflow-hidden">
          <a href="#">
            <img
              src="https://cdn.discordapp.com/attachments/1153766321666932836/1243890307100315709/Banner_RoV.png?ex=66531e9f&is=6651cd1f&hm=3eb9a1c2319c8b02bcac001e421b61cf9a7460ae7e07baabfd5a3afbd555f1a4&"
              class="h-full w-full"
            />
          </a>
        </div>
      </div>
    </div>
<div>
 
</div>

<div>
    <!-- หัวข้อหลักของหน้าเว็บ -->
    <div class="text-center text-2xl font-bold mt-4">
      รายละเอียด หลักเกณฑ์การแข่งขัน E-Sports (ROV) ประจำปี 2567 
      ระดับมัธยมศึกษาตอนปลาย หรือ ระดับประกาศนียบัตรวิชาชีพ 
      และระดับทั่วไป
    </div>
    
    <!-- หัวข้อหลักของกติกาและข้อกำหนด -->
    <div class="section-title">กติกา ข้อกำหนดของการแข่งขัน</div>
    
    <!-- ลำดับเนื้อหา -->
    <ol>
      <li>
        <h2>1.1 ประเภทการแข่งขัน:</h2>
        <p>เป็นการแข่งขัน เกม Arena of Valor (ROV) โดยแบ่งเป็น 2 ระดับ ดังนี้</p>
        <ol>
          <li>
            <p>1.1.1 ระดับมัธยมศึกษาตอนปลาย หรือ ระดับประกาศนียบัตรวิชาชีพ (ปวช.)</p>
          </li>
          <li>
            <p>1.1.2 ระดับทั่วไป</p>
          </li>
        </ol>
      </li>
      <li>
        <ol>
          <li>
            <h2>1.2 ระดับมัธยมศึกษาตอนปลาย หรือ ระดับประกาศนียบัตรวิชาชีพ</h2>
            <p class="highlight-red">(รับสมัครเพียง 16 ทีม เท่านั้น)</p>
            <ul>
              <li>แต่ละสถาบันสามารถส่งทีมเข้าร่วมแข่งขันได้เพียง 1 ทีม ต่อ 1 สถาบัน</li>
              <li>สมัครเป็นทีม ทีมละ 5 คน หรือ สำรอง 1 คน (ถ้ามี) โดยไม่จำกัดเพศ และอาจารย์ที่ปรึกษาทีม 1 คน</li>
              <li>ผู้เข้าร่วมแข่งขันทุกคนจะต้องเตรียมบัตรประชาชนหรือสำเนาบัตรประชาชน จำนวน 1 ชุด มาด้วยในวันแข่งขัน</li>
              <li>ผู้เข้าร่วมแข่งขันไม่จำเป็นต้องรับซิมจากทางบริษัททรูและสมัครแพ็คเน็ตใด ๆ</li>
              <li>สิทธิพิเศษ: ผู้ชนะเลิศลำดับที่ 1 จะเป็นตัวแทนเข้าร่วมแข่งขันรอบคัดเลือกตัวแทนจังหวัด Winter (Tournament) โดยไม่ต้องเสียค่าเติมแพ็คเกจ</li>
            </ul>
          </li>
          <li>
            <h2>1.2.1 ระดับทั่วไป (ประเภทบุคคลทั่วไป ไม่จำกัดอายุ ไม่จำกัดเพศ)</h2>
            <p class="highlight-red">(รับสมัครเพียง 32 ทีม เท่านั้น)</p>
            <ul>
              <li>เป็นการแข่งขันของ True5G Esports Tournament 2024 สนามแข่งขันเชียงใหม่ โดยผู้ชนะเลิศลำดับที่ 1-2 จะเป็นตัวแทนเข้าแข่งขันรอบคัดเลือกตัวแทนจังหวัด Winter (Tournament) โดยไม่ต้องเสียค่าเติมแพ็คเกจ</li>
              <li>สมัครเป็นทีม ทีมละ 5 คน และสำรอง 1 คน โดยไม่จำกัดเพศ รวมเป็นทีมละ 6 คน</li>
              <li>ผู้เข้าร่วมแข่งขันทุกคนจะต้องเตรียมบัตรประชาชนหรือสำเนาบัตรประชาชน จำนวน 1 ชุด มาด้วยในวันแข่งขัน</li>
              <li>ผู้สมัครแข่งขันทุกคนจะต้องรับซิมจากทางบริษัททรู และเติมเงิน สมัครแพ็คเน็ต 100 บาท ต่อคน และใช้ซิมของบริษัททรูในการแข่งขันเท่านั้น โดยผู้เข้าแข่งขันสามารถมารับและลงทะเบียนซิมจากบริษัททรูในวันเสาร์ที่ 17 สิงหาคม 2567 เวลา 9.00-16.00 น. ณ ลานใต้ถุนอาคารจุฬาภรณ์ คณะวิทยาศาสตร์ มหาวิทยาลัยแม่โจ้</li>
            </ul>
          </li>
        </ol>
      </li>
      <li>
        <h2>1.3 รูปแบบการแข่งขัน</h2>
        <ul>
          <li>1.3.1 การจับคู่แข่งขันของทั้ง 2 ระดับจะเป็นแบบสุ่ม โดยจัดลงตารางสำเร็จ เพื่อคัดเลือกและแบ่งสายทีมแข่งขัน</li>
          <li>1.3.2 ทั้ง 2 ระดับแข่งขันในโหมด 5V5</li>
          <li>
            1.3.3 อุปกรณ์การแข่งขันของทั้ง 2 ระดับ
            <ul>
              <li>ผู้แข่งขันจะต้องใช้โทรศัพท์มือถือส่วนตัวเท่านั้น</li>
              <li>ไม่อนุญาตให้ใช้ Tablet/iPad</li>
              <li>สามารถใช้หูฟังส่วนตัวได้</li>
            </ul>
          </li>
          <li>
            1.3.4 เกณฑ์การแข่งขันในระดับมัธยมศึกษาตอนปลาย หรือ ระดับประกาศนียบัตรวิชาชีพ
            <ul>
              <li>รอบคัดเลือก แบบแพ้ชนะในตาเดียว (Death match)</li>
              <li>รอบชิงชนะเลิศ แข่งขันแบบชนะ 2 ใน 3 Global pick ban</li>
            </ul>
          </li>
          <li>
            1.3.5 เกณฑ์การแข่งขันในระดับทั่วไป
            <ul>
              <li>รอบคัดเลือก แบบแพ้ชนะในตาเดียว (Death match)</li>
              <li>รอบ 8 ทีมสุดท้าย แข่งขันแบบชนะ 2 ใน 3 Normal pick ban</li>
              <li>รอบชิงชนะเลิศ แข่งขันแบบชนะ 2 ใน 3 Global pick ban</li>
            </ul>
          </li>
          <li>1.3.6 ห้ามใช้กริยา, ท่าทาง หรือ คำพูดที่ไม่เหมาะสมตลอดการแข่งขัน มีโทษปรับแพ้ทันที</li>
          <li>1.3.7 ผู้เข้าแข่งขัน 1 คน สามารถเข้าร่วมทีมได้เพียง 1 ทีมเท่านั้น</li>
        </ul>
      </li>
      <li>
        <h2>1.4 คณะกรรมการตัดสิน</h2>
        <ul>
          <li>คณาจารย์หลักสูตรฯสาขาวิชาวิทยาการคอมพิวเตอร์ คณะวิทยาศาสตร์ มหาวิทยาลัยแม่โจ้ ของศูนย์ภาคที่จัดกิจกรรม</li>
          <li>เจ้าหน้าที่จากทางบริษัททรู คอร์ปอเรชั่น จำกัด (มหาชน)</li>
        </ul>
        <p>หมายเหตุ: การตัดสินของคณะกรรมการตัดสินถือเป็นที่สิ้นสุด</p>
      </li>
    </ol>
  </div>
  <div class="section-title mt-8">รางวัล</div>

<!-- ตารางรางวัล -->
<div>
  <h2>2.1 ระดับมัธยมศึกษาตอนปลาย หรือ ระดับประกาศนียบัตรวิชาชีพ</h2>
  <table class="prizes-table">
    <thead>
      <tr>
        <th>รางวัล</th>
        <th>จำนวนเงิน</th>
        <th>รายละเอียด</th>
      </tr>
    </thead>
    <tbody>
      <tr>
        <td>รางวัลที่ 1</td>
        <td>3,000 บาท</td>
        <td>พร้อมใบประกาศเกียรติคุณและของที่ระลึกจากบริษัททรู</td>
      </tr>
      <tr>
        <td>รางวัลที่ 2</td>
        <td>2,000 บาท</td>
        <td>พร้อมใบประกาศเกียรติคุณและของที่ระลึกจากบริษัททรู</td>
      </tr>
      <tr>
        <td>รางวัลที่ 3</td>
        <td>1,000 บาท</td>
        <td>พร้อมใบประกาศเกียรติคุณและของที่ระลึกจากบริษัททรู</td>
      </tr>
      <tr>
        <td>รางวัลชมเชย</td>
        <td>600 บาท</td>
        <td>พร้อมใบประกาศเกียรติคุณและของที่ระลึกจากบริษัททรู</td>
      </tr>
    </tbody>
  </table>
  <p class="highlight-red">
    หมายเหตุ: ทุกทีมที่เข้าร่วมการแข่งขันจะได้รับใบประกาศเกียรติคุณเข้าร่วมการแข่งขันทุกคน
  </p>
</div>

<div>
  <h2>2.2 สำหรับระดับทั่วไป</h2>
  <table class="prizes-table">
    <thead>
      <tr>
        <th>รางวัล</th>
        <th>จำนวนเงิน</th>
        <th>รายละเอียด</th>
      </tr>
    </thead>
    <tbody>
      <tr>
        <td>รางวัลที่ 1</td>
        <td>3,000 บาท</td>
        <td>พร้อมใบประกาศเกียรติคุณและของที่ระลึกจากบริษัททรู</td>
      </tr>
      <tr>
        <td>รางวัลที่ 2</td>
        <td>2,000 บาท</td>
        <td>พร้อมใบประกาศเกียรติคุณและของที่ระลึกจากบริษัททรู</td>
      </tr>
      <tr>
        <td>รางวัลที่ 3</td>
        <td>1,000 บาท</td>
        <td>พร้อมใบประกาศเกียรติคุณและของที่ระลึกจากบริษัททรู</td>
      </tr>
      <tr>
        <td>รางวัลชมเชย</td>
        <td>600 บาท</td>
        <td>พร้อมใบประกาศเกียรติคุณและของที่ระลึกจากบริษัททรู</td>
      </tr>
    </tbody>
  </table>
</div>
     
    <footer class="text-center text-l font-bold mt-4">
      ติดต่อสอบถามรายละเอียดได้ที่ผู้ประสานงานฝ่ายการแข่งขัน  นางสาวช่อทิพย์  สิทธิ 053-873890 ต่อ 25 หรือ
inbox  ทางเพจ วิทยาการคอมพิวเตอร์  ม.แม่โจ้

    </footer>
  </main>
</template>


<style >
.section-title {
  color: red;
  font-size: 24px;
  margin-bottom: 16px;
  font-weight: bold;
}

h2 {
  font-size: 20px;
  margin-top: 16px;
  margin-bottom: 8px;
}

p {
  margin: 8px 0;
}

.highlight-red {
  color: red;
}

ol, ul {
  margin-left: 20px;
}

ul {
  list-style-type: disc;
}

li {
  margin-bottom: 8px;
}
.prizes-table {
  width: 100%;
  border-collapse: collapse;
  margin-top: 16px;
}

.prizes-table th, .prizes-table td {
  border: 1px solid #ddd;
  padding: 8px;
}

.prizes-table th {
  background-color: #f2f2f2;
  text-align: left;
}

.highlight-red {
  color: red;
  margin-top: 16px;
}
</style>

<script>
export default {
  name: 'CompetitionRules'
}
</script>

